In [1]:
import pandas as pd

In [16]:
data = [[100,25,10],
       [200,20,11],
       [300,15,12],
       [350,16,13],
       [320,17,12]]
df = pd.DataFrame(data,
                 index = ['1월', '2월', '3월','4월','5월'],
                 columns=['매출액', '영업이익', '순이익'])
df

    매출액  영업이익  순이익
1월  100    25   10
2월  200    20   11
3월  300    15   12
4월  350    16   13
5월  320    17   12

# 행 조회

In [7]:
df.loc[['2월']]
df.loc['2월'] #두 개가 다른 형태로 나옴

매출액     200
영업이익     20
순이익      11
Name: 2월, dtype: int64

In [8]:
df.loc[['2월', '3월']]

    매출액  영업이익  순이익
2월  200    20   11
3월  300    15   12

In [11]:
df.loc[df.index != '2월']

    매출액  영업이익  순이익
1월  100    25   10
3월  300    15   12
4월  350    16   13
5월  320    17   12

In [13]:
df.loc['1월' :'4월']

    매출액  영업이익  순이익
1월  100    25   10
2월  200    20   11
3월  300    15   12
4월  350    16   13

In [15]:
df.loc[[True, True, False, False, True]]

    매출액  영업이익  순이익
1월  100    25   10
2월  200    20   11
5월  320    17   12

# 열 조회

In [17]:
df.loc[:, '매출액']

1월    100
2월    200
3월    300
4월    350
5월    320
Name: 매출액, dtype: int64

In [19]:
df.loc[:, ['매출액']]

    매출액
1월  100
2월  200
3월  300
4월  350
5월  320

In [20]:
df.loc[:, df.columns != '매출액']

    영업이익  순이익
1월    25   10
2월    20   11
3월    15   12
4월    16   13
5월    17   12

In [21]:
df.loc[:, '매출액' : '순이익']

    매출액  영업이익  순이익
1월  100    25   10
2월  200    20   11
3월  300    15   12
4월  350    16   13
5월  320    17   12

In [22]:
df.loc[:, [False, True, True]]

    영업이익  순이익
1월    25   10
2월    20   11
3월    15   12
4월    16   13
5월    17   12

# 행과 열 조회

In [23]:
df.loc['1월', '영업이익']

25

In [24]:
df.loc[['1월', '3월'], ['영업이익', '순이익']]

    영업이익  순이익
1월    25   10
3월    15   12